TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/demos/field_transmitter/ti/driverlib/dl_unicommi2cc.h
/** @enum DL_I2CC_ADDRESSING_MODE */
typedef enum {
    /*! Enable in 7-bit addressing mode */
    DL_I2CC_ADDRESSING_MODE_7_BIT = UNICOMMI2CC_TA_MODE_MODE7,
    /*! Enable in 10-bit addressing mode */
    DL_I2CC_ADDRESSING_MODE_10_BIT = UNICOMMI2CC_TA_MODE_MODE10,
} DL_I2CC_ADDRESSING_MODE;

/** @enum DL_I2CC_PEC_STATUS */
typedef enum {
    /*!  I2CC SMBus/PMBus PEC was checked in the transaction that
     *   occurred before the last Stop */
    DL_I2CC_PEC_STATUS_CHECKED = UNICOMMI2CC_PECSR_PECSTS_CHECK_SET,
    /*!  I2CC SMBus/PMBus PEC was not checked in the transaction that
     *   occurred the last Stop */
    DL_I2CC_PEC_STATUS_NOT_CHECKED = UNICOMMI2CC_PECSR_PECSTS_CHECK_CLEARED,
} DL_I2CC_PEC_STATUS;

/** @enum DL_I2CC_PEC_CHECK_ERROR */
typedef enum {
    /*! I2CC SMBus/PMBus PEC check error occurred in the transaction
     *  before the last stop */
    DL_I2CC_PEC_CHECK_ERROR_SET = UNICOMMI2CC_PECSR_PECSTS_ERROR_SET,
    /*! I2CC SMBus/PMBus PEC check error did not occur in the
     *  transaction before the last stop */
    DL_I2CC_PEC_CHECK_ERROR_CLEARED = UNICOMMI2CC_PECSR_PECSTS_ERROR_CLEARED,
} DL_I2CC_PEC_CHECK_ERROR;

/** @enum DL_I2CC_SCL */
typedef enum {
    /*!  I2CC SCL signal high */
    DL_I2CC_SCL_HIGH = UNICOMMI2CC_BMON_SCL_SET,
    /*!  I2CC SCL signal low */
    DL_I2CC_SCL_LOW = UNICOMMI2CC_BMON_SCL_CLEARED,
} DL_I2CC_SCL;

/** @enum DL_I2CC_SDA */
typedef enum {
    /*!  I2CC SDA signal high */
    DL_I2CC_SDA_HIGH = UNICOMMI2CC_BMON_SDA_SET,
    /*!  I2CC SDA signal low */
    DL_I2CC_SDA_LOW = UNICOMMI2CC_BMON_SDA_CLEARED,
} DL_I2CC_SDA;

/** @enum DL_I2CC_START */
typedef enum {
    /*!  generates START condition */
    DL_I2CC_START_ENABLE = UNICOMMI2CC_CTR_START_ENABLE,
    /*!  doesn't generate START condition */
    DL_I2CC_START_DISABLE = UNICOMMI2CC_CTR_START_DISABLE,
} DL_I2CC_START;

/** @enum DL_I2CC_STOP */
typedef enum {
    /*!  generates STOP condition */
    DL_I2CC_STOP_ENABLE = UNICOMMI2CC_CTR_STOP_ENABLE,
    /*!  doesn't generate STOP condition */
    DL_I2CC_STOP_DISABLE = UNICOMMI2CC_CTR_STOP_DISABLE,
} DL_I2CC_STOP;

/** @enum DL_I2CC_ACK */
typedef enum {
    /*!  Last received data byte of a transaction is not ACKed automatically */
    DL_I2CC_ACK_ENABLE = UNICOMMI2CC_CTR_ACK_ENABLE,
    /*!  Last received data byte of a transaction is ACKed automatically */
    DL_I2CC_ACK_DISABLE = UNICOMMI2CC_CTR_ACK_DISABLE,
} DL_I2CC_ACK;

/** @enum DL_I2CC_TX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when FIFO <= 3/4 empty */
    DL_I2CC_TX_FIFO_LEVEL_3_4_EMPTY = UNICOMMI2CC_IFLS_TXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when FIFO <= 1/2 empty */
    DL_I2CC_TX_FIFO_LEVEL_1_2_EMPTY = UNICOMMI2CC_IFLS_TXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when FIFO <= 1/4 empty */
    DL_I2CC_TX_FIFO_LEVEL_1_4_EMPTY = UNICOMMI2CC_IFLS_TXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when FIFO is not full */
    DL_I2CC_TX_FIFO_LEVEL_ONE_ENTRY = UNICOMMI2CC_IFLS_TXIFLSEL_LVL_NOT_FULL,
    /*! Interrupt triggers when FIFO is empty */
    DL_I2CC_TX_FIFO_LEVEL_EMPTY = UNICOMMI2CC_IFLS_TXIFLSEL_LVL_EMPTY,
    /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
    DL_I2CC_TX_FIFO_LEVEL_ALMOST_EMPTY =
        UNICOMMI2CC_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
    /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
    DL_I2CC_TX_FIFO_LEVEL_ALMOST_FULL =
        UNICOMMI2CC_IFLS_TXIFLSEL_LVL_ALMOST_FULL
} DL_I2CC_TX_FIFO_LEVEL;

/** @enum DL_I2CC_RX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when FIFO >= 3/4 full */
    DL_I2CC_RX_FIFO_LEVEL_3_4_FULL = UNICOMMI2CC_IFLS_RXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when FIFO >= 1/2 full */
    DL_I2CC_RX_FIFO_LEVEL_1_2_FULL = UNICOMMI2CC_IFLS_RXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when FIFO >= 1/4 full */
    DL_I2CC_RX_FIFO_LEVEL_1_4_FULL = UNICOMMI2CC_IFLS_RXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when FIFO is not empty */
    DL_I2CC_RX_FIFO_LEVEL_ONE_ENTRY = UNICOMMI2CC_IFLS_RXIFLSEL_LVL_NOT_EMPTY,
    /*! Interrupt triggers when FIFO is full */
    DL_I2CC_RX_FIFO_LEVEL_FULL = UNICOMMI2CC_IFLS_RXIFLSEL_LVL_FULL,
    /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
    DL_I2CC_RX_FIFO_LEVEL_ALMOST_FULL =
        UNICOMMI2CC_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
    /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
    DL_I2CC_RX_FIFO_LEVEL_ALMOST_EMPTY =
        UNICOMMI2CC_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY,
} DL_I2CC_RX_FIFO_LEVEL;

/*! @enum DL_I2CC_IIDX */
typedef enum {
    /*! Interrupt index for I2CC if no interrupt is pending */
    DL_I2CC_IIDX_NO_INT = UNICOMMI2CC_IIDX_STAT_NO_INTR,
    /*! Interrupt index for I2CC Receive Transaction completed */
    DL_I2CC_IIDX_RX_DONE = UNICOMMI2CC_IIDX_STAT_RXDONEFG,
    /*! Interrupt index for Transmit Transaction completed */
    DL_I2CC_IIDX_TX_DONE = UNICOMMI2CC_IIDX_STAT_TXDONEFG,
    /*! Interrupt index for I2CC Receive FIFO Trigger */
    DL_I2CC_IIDX_RXFIFO_TRIGGER = UNICOMMI2CC_IIDX_STAT_RXTRG,
    /*! Interrupt index for I2CC Transmit FIFO Trigger */
    DL_I2CC_IIDX_TXFIFO_TRIGGER = UNICOMMI2CC_IIDX_STAT_TXTRG,
    /*! Interrupt index for I2CC Receive when FIFO is full */
    DL_I2CC_IIDX_RXFIFO_FULL = UNICOMMI2CC_IIDX_STAT_RXFULL,
    /*! Interrupt index for I2CC when Transmit FIFO is empty */
    DL_I2CC_IIDX_TXFIFO_EMPTY = UNICOMMI2CC_IIDX_STAT_TXEMPTY,
    /*! Interrupt index for Address/Data NACK */
    DL_I2CC_IIDX_NACK = UNICOMMI2CC_IIDX_STAT_NACKFG,
    /*! Interrupt index for I2CC START Detection */
    DL_I2CC_IIDX_START = UNICOMMI2CC_IIDX_STAT_STARTFG,
    /*! Interrupt index for I2CC STOP Detection */
    DL_I2CC_IIDX_STOP = UNICOMMI2CC_IIDX_STAT_STOPFG,
    /*! Interrupt index for I2CC Arbitration Lost */
    DL_I2CC_IIDX_ARBITRATION_LOST = UNICOMMI2CC_IIDX_STAT_ARBLOSTFG,
    /*! Interrupt index for I2CC Event 1 DMA Done */
    DL_I2CC_IIDX_EVENT1_DMA_DONE = UNICOMMI2CC_IIDX_STAT_DMA_DONE_TX,
    /*! Interrupt index for I2CC Event 2 DMA Done */
    DL_I2CC_IIDX_EVENT2_DMA_DONE = UNICOMMI2CC_IIDX_STAT_DMA_DONE_RX,
    /*! Interrupt index for I2CC receive pre-emptive interrupt */
    DL_I2CC_IIDX_PREEMPT_INT_TX = UNICOMMI2CC_IIDX_STAT_DMA_PREIRQ_TX,
    /*! Interrupt index for I2CC receive pre-emptive interrupt */
    DL_I2CC_IIDX_PREEMPT_INT_RX = UNICOMMI2CC_IIDX_STAT_DMA_PREIRQ_RX,
    /*! Interrupt index for I2CC SMBus/PMBus PEC Receive Error Event */
    DL_I2CC_IIDX_PEC_RX_ERROR = UNICOMMI2CC_IIDX_STAT_PEC_RX_ERR,
    /*! Interrupt index for I2CC Timeout A Event */
    DL_I2CC_IIDX_TIMEOUT_A = UNICOMMI2CC_IIDX_STAT_TIMEOUTA,
    /*! Interrupt index for I2CC Timeout B Event */
    DL_I2CC_IIDX_TIMEOUT_B = UNICOMMI2CC_IIDX_STAT_TIMEOUTB,
} DL_I2CC_IIDX;

/**
 * @brief  Configuration struct for @ref DL_I2CC_setClockConfig.
 */
typedef struct {
    /*! I2CC module clock source. One of @ref DL_I2CC_CLOCK */
    DL_I2CC_CLOCK clockSel;
    /*! I2CC clock divider selection. One of @ref DL_I2CC_CLOCK_DIVIDE */
    DL_I2CC_CLOCK_DIVIDE divideRatio;
} DL_I2CC_ClockConfig;

/**
 *  @brief      Configure I2CC source clock
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                       @ref DL_I2CC_ClockConfig.
 */
void DL_I2CC_setClockConfig(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_ClockConfig *config);

/**
 *  @brief      Get I2CC source clock configuration
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                      @ref DL_I2CC_ClockConfig.
 */
void DL_I2CC_getClockConfig(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_ClockConfig *config);

/**
 *  @brief      Fills the TX FIFO with data
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Pointer to buffer of bytes
 *  @param[in]  count   Number of bytes to fill TX FIFO from buffer
 *                      [0x00, 0xFFF]
 *
 *  @return     Number of bytes that were successfully written
 */
uint16_t DL_I2CC_fillTXFIFO(
    UNICOMM_Inst_Regs *unicomm, uint8_t *buffer, uint16_t count);

/**
 *  @brief      Flushes/removes all elements in the TX FIFO
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
void DL_I2CC_flushTXFIFO(UNICOMM_Inst_Regs *unicomm);

/**
 *  @brief      Flushes/removes all elements in the RX FIFO
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
void DL_I2CC_flushRXFIFO(UNICOMM_Inst_Regs *unicomm);

/**
 *  @brief      Stop TX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2CC_isTXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_stopFlushTXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->IFLS &= ~(UNICOMMI2CC_IFLS_TXCLR_MASK);
}

/**
 *  @brief      Start TX FIFO flush
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_startFlushTXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->IFLS |= UNICOMMI2CC_IFLS_TXCLR_MASK;
}

/**
 *  @brief      Stop RX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2CC_isRXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_stopFlushRXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->IFLS &= ~(UNICOMMI2CC_IFLS_RXCLR_MASK);
}

/**
 *  @brief      Start RX FIFO flush
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_startFlushRXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->IFLS |= UNICOMMI2CC_IFLS_RXCLR_MASK;
}

/**
 *  @brief      Checks if TX FIFO is full
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX FIFO is full
 *
 *  @retval     true if TX FIFO is full
 *  @retval     false if TX FIFO is not full
 */
__STATIC_INLINE bool DL_I2CC_isTXFIFOFull(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->SR & UNICOMMI2CC_SR_TXFF_MASK) ==
            UNICOMMI2CC_SR_TXFF_SET);
}

/**
 *  @brief      Checks if TX FIFO is empty
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX FIFO is empty
 *
 *  @retval     true if TX FIFO is empty
 *  @retval     false if TX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2CC_isTXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->SR & UNICOMMI2CC_SR_TXFE_MASK) ==
            UNICOMMI2CC_SR_TXFE_SET);
}

/**
 *  @brief      Checks if RX FIFO is full
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If RX FIFO is full
 *
 *  @retval     true if RX FIFO is full
 *  @retval     false if RX FIFO is not full
 */
__STATIC_INLINE bool DL_I2CC_isRXFIFOFull(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->SR & UNICOMMI2CC_SR_RXFF_MASK) ==
            UNICOMMI2CC_SR_RXFF_SET);
}

/**
 *  @brief      Checks if RX FIFO is empty
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If RX FIFO is empty
 *
 *  @retval     true if RX FIFO is empty
 *  @retval     false if RX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2CC_isRXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->SR & UNICOMMI2CC_SR_RXFE_MASK) ==
            UNICOMMI2CC_SR_RXFE_SET);
}

/**
 *  @brief      Reset transfers from from UNICOMMI2CC
 *
 *  Resets transfer register to initialize UNICOMMI2CC
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_resetTransfer(UNICOMM_Inst_Regs *unicomm)
{
    // Resets all functionality
    unicomm->i2cc->CTR = 0x00;
}

/**
 *  @brief      Sets up a transfer from UNICOMMI2CC
 *
 *  Set target address, transfer direction, burst length, START+STOP generation.
 *  @note   Reading/writing data must be done separately.
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *  @param[in]  targetAddr  Target address [0x00, 0x3FF]
 *  @param[in]  direction   One of @ref DL_I2CC_DIRECTION
 *  @param[in]  length      Intended burst length in number of bytes
 *                          [0x00, 0xFFF]
 */
__STATIC_INLINE void DL_I2CC_startTransfer(UNICOMM_Inst_Regs *unicomm,
    uint32_t targetAddr, DL_I2CC_DIRECTION direction, uint16_t length)
{
    // Specify target address and read/write mode
    DL_Common_updateReg(&unicomm->i2cc->TA,
        ((targetAddr << UNICOMMI2CC_TA_ADDR_OFS) | (uint32_t) direction),
        (UNICOMMI2CC_TA_ADDR_MASK | UNICOMMI2CC_TA_DIR_MASK));

    // STOP bit is generated after burst length number of bytes transferred
    DL_Common_updateReg(&unicomm->i2cc->CTR,
        (((uint32_t) length << UNICOMMI2CC_CTR_BLEN_OFS) |
            UNICOMMI2CC_CTR_FRM_START_ENABLE | UNICOMMI2CC_CTR_START_ENABLE |
            UNICOMMI2CC_CTR_STOP_ENABLE),
        (UNICOMMI2CC_CTR_BLEN_MASK | UNICOMMI2CC_CTR_FRM_START_MASK |
            UNICOMMI2CC_CTR_START_MASK | UNICOMMI2CC_CTR_STOP_MASK));
}

/**
 *  @brief      Sets up a transfer from I2CC with control of START,
 *  STOP and ACK
 *
 *  @note   Reading/writing data must be done separately.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  targetAddr  7-bit target address [0x00, 0x7f]
 *  @param[in]  direction   One of @ref DL_I2CC_DIRECTION
 *  @param[in]  length      Intended burst length in number of bytes
 *  @param[in]  start       One of @ref DL_I2CC_START
 *  @param[in]  stop        One of @ref DL_I2CC_STOP
 *  @param[in]  ack         One of @ref DL_I2CC_ACK
 */
__STATIC_INLINE void DL_I2CC_startTransferAdvanced(UNICOMM_Inst_Regs *unicomm,
    uint32_t targetAddr, DL_I2CC_DIRECTION direction, uint16_t length,
    DL_I2CC_START start, DL_I2CC_STOP stop, DL_I2CC_ACK ack)
{
    // Specify target address and read/write mode
    DL_Common_updateReg(&unicomm->i2cc->TA,
        ((targetAddr << UNICOMMI2CC_TA_ADDR_OFS) | (uint32_t) direction),
        (UNICOMMI2CC_TA_ADDR_MASK | UNICOMMI2CC_TA_DIR_MASK));

    DL_Common_updateReg(&unicomm->i2cc->CTR,
        (((uint32_t) length << UNICOMMI2CC_CTR_BLEN_OFS) |
            UNICOMMI2CC_CTR_FRM_START_ENABLE | (uint32_t) start |
            (uint32_t) stop | (uint32_t) ack),
        (UNICOMMI2CC_CTR_BLEN_MASK | UNICOMMI2CC_INTCTL_INTEVAL_MASK |
            UNICOMMI2CC_CTR_START_MASK | UNICOMMI2CC_CTR_STOP_MASK |
            UNICOMMI2CC_CTR_ACK_MASK));
}

/**
 * @brief Enables power on UNICOMM I2C module
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enablePower(UNICOMM_Inst_Regs *unicomm)
{
    DL_UNICOMM_enablePower(unicomm);
    if (unicomm->fixedMode == false) {
        DL_UNICOMM_setIPMode(unicomm, DL_UNICOMM_I2C_CONTROLLER);
    }
}

/**
 * @brief Disables power on UNICOMM I2C module
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disablePower(UNICOMM_Inst_Regs *unicomm)
{
    DL_UNICOMM_disablePower(unicomm);
}

/**
 * @brief Returns if  power on UNICOMM I2C module
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_I2CC_isPowerEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return DL_UNICOMM_isPowerEnabled(unicomm);
}

/**
 * @brief Resets UNICOMM I2C peripheral
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_reset(UNICOMM_Inst_Regs *unicomm)
{
    DL_UNICOMM_reset(unicomm);
}

/**
 * @brief Returns if UNICOMM I2C peripheral was reset
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_I2CC_isReset(UNICOMM_Inst_Regs *unicomm)
{
    return DL_UNICOMM_isReset(unicomm);
}

/**
 * @brief Set Clock Source
 *
 *  Clock sources depend on device and clock should be enabled
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  clockSource    One of @ref DL_I2CC_CLOCK.
 *
 */
__STATIC_INLINE void DL_I2CC_selectClockSource(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_CLOCK clockSource)
{
    DL_Common_updateReg(&unicomm->i2cc->CLKSEL, (uint32_t) clockSource,
        UNICOMMI2CC_CLKSEL_BUSCLK_SEL_MASK |
            UNICOMMI2CC_CLKSEL_MFCLK_SEL_MASK);
}

/**
 * @brief Set Clock Divider
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  clockDivider   One of @ref DL_I2CC_CLOCK_DIVIDE.
 *
 */
__STATIC_INLINE void DL_I2CC_selectClockDivider(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_CLOCK_DIVIDE clockDivider)
{
    DL_Common_updateReg(&unicomm->i2cc->CLKDIV, (uint32_t) clockDivider,
        UNICOMMI2CC_CLKDIV_RATIO_MASK);
}

/**
 *  @brief      Get Digital Glitch Suppression Pulse Width
 *
 *  Pulse width for the digital glitch suppression on SCL/SDA lines.
 *  Values are in terms of functional clock ticks.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Digital glitch suppression pulse width
 *
 *  @retval     One of @ref DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH
DL_I2CC_getDigitalGlitchFilterPulseWidth(UNICOMM_Inst_Regs *unicomm)
{
    uint32_t filterWidth =
        unicomm->i2cc->GFCTL & UNICOMMI2CC_GFCTL_DGFSEL_MASK;

    return (DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH)(filterWidth);
}

/**
 *  @brief      Set Digital Glitch Suppression Pulse Width
 *
 *  Pulse width for the digital glitch suppression on SCL/SDA lines.
 *  Values are in terms of functional clock ticks.
 *
 *  @param[in]  unicomm             Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  filterWidth     One of @ref DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE void DL_I2CC_setDigitalGlitchFilterPulseWidth(
    UNICOMM_Inst_Regs *unicomm,
    DL_I2CC_DIGITAL_GLITCH_FILTER_WIDTH filterWidth)
{
    DL_Common_updateReg(&unicomm->i2cc->GFCTL, (uint32_t) filterWidth,
        UNICOMMI2CC_GFCTL_DGFSEL_MASK);
}

/**
 *  @brief      Disable Analog Glitch Suppression
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableAnalogGlitchFilter(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->GFCTL &= ~(UNICOMMI2CC_GFCTL_AGFEN_MASK);
}

/**
 *  @brief      Checks if analog glitch suppression is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If analog glitch suppression is enabled
 *
 *  @retval     true if analog glitch suppression is enabled
 *  @retval     false if analog glitch suppression is disabled
 */
__STATIC_INLINE bool DL_I2CC_isAnalogGlitchFilterEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->GFCTL & UNICOMMI2CC_GFCTL_AGFEN_MASK) ==
            UNICOMMI2CC_GFCTL_AGFEN_ENABLE);
}

/**
 *  @brief      Enable Analog Glitch Suppression
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableAnalogGlitchFilter(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->GFCTL |= UNICOMMI2CC_GFCTL_AGFEN_ENABLE;
}

/**
 *  @brief      Get direction of next operation
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Direction of next operation
 *
 *  @retval     One of @ref DL_I2CC_DIRECTION
 */
__STATIC_INLINE DL_I2CC_DIRECTION DL_I2CC_getDirection(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t direction = unicomm->i2cc->TA & UNICOMMI2CC_TA_DIR_MASK;

    return (DL_I2CC_DIRECTION)(direction);
}

/**
 *  @brief      Set direction of next operation
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @param[in]  direction   Direction of next operation.
 *                          One of @ref DL_I2CC_DIRECTION.
 */
__STATIC_INLINE void DL_I2CC_setDirection(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_DIRECTION direction)
{
    DL_Common_updateReg(
        &unicomm->i2cc->TA, (uint32_t) direction, UNICOMMI2CC_TA_DIR_MASK);
}

/**
 *  @brief      Get the address of the target being addressed when configured
 *              as an UNICOMMI2CC
 *
 *  Specifies bits A9 through A0 of the target address.
 *  In 7-bit addressing mode as selected by @ref DL_I2CC_setAddressingMode,
 *  the top 3 bits are don't care.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The target address
 *
 *  @retval     [0x00, 0x07FE]
 *
 *  @sa         DL_I2CC_setAddressingMode
 */
__STATIC_INLINE uint32_t DL_I2CC_getTargetAddress(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->TA & UNICOMMI2CC_TA_ADDR_MASK) >>
            UNICOMMI2CC_TA_ADDR_OFS);
}

/**
 *  @brief      Set the address of the target being addressed when configured
 *              as an UNICOMMI2CC
 *
 *  Specifies bits A9 through A0 of the target address.
 *  In 7-bit addressing mode as selected by @ref DL_I2CC_setAddressingMode,
 *  the top 3 bits are don't care.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  targetAddress    Target address to set [0x00, 0x07FE]
 *
 *  @sa         DL_I2CC_setAddressingMode
 */
__STATIC_INLINE void DL_I2CC_setTargetAddress(
    UNICOMM_Inst_Regs *unicomm, uint32_t targetAddress)
{
    DL_Common_updateReg(&unicomm->i2cc->TA,
        (targetAddress << UNICOMMI2CC_TA_ADDR_OFS), UNICOMMI2CC_TA_ADDR_MASK);
}

/**
 *  @brief      Get addressing mode
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Addressing mode the is set to
 *
 *  @retval     One of @ref DL_I2CC_ADDRESSING_MODE
 *
 */
__STATIC_INLINE DL_I2CC_ADDRESSING_MODE DL_I2CC_getAddressingMode(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t mode = unicomm->i2cc->TA & UNICOMMI2CC_TA_MODE_MASK;

    return (DL_I2CC_ADDRESSING_MODE)(mode);
}

/**
 *  @brief      Set addressing mode between 7-bit and 10-bit mode
 *
 *  Selects the addressing mode between 7-bit and 10-bit mode to be used when
 *  device is configured as a
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  mode    Addressing mode to set the target to.
 *                      One of @ref DL_I2CC_ADDRESSING_MODE.
 */
__STATIC_INLINE void DL_I2CC_setAddressingMode(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_ADDRESSING_MODE mode)
{
    DL_Common_updateReg(
        &unicomm->i2cc->TA, (uint32_t) mode, UNICOMMI2CC_TA_MODE_MASK);
}

/**
 *  @brief      Disable ACK override
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableACKOverride(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR &= ~(UNICOMMI2CC_CTR_ACKOEN_MASK);
}

/**
 *  @brief      Checks if ACK override is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If ACK override is enabled
 *
 *  @retval     true if ACK override is enabled
 *  @retval     false if ACK override is disabled
 */
__STATIC_INLINE bool DL_I2CC_isACKOverrideEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CTR & UNICOMMI2CC_CTR_ACKOEN_MASK) ==
            UNICOMMI2CC_CTR_ACKOEN_ENABLE);
}

