TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/demos/field_transmitter/ti/driverlib/dl_unicommi2cc.h
/**
 *  @brief      Enable ACK override
 *
 *  When enabled and the is receiving data and the number of bytes
 *  indicated in CTR.MBLEN have been received, the state machine will generate
 *  an RXDONE interrupt and wait at the start of the ACK for FW to indicate if
 *  an ACK or NACK should be sent. The ACK or NACK is selected by writing the
 *  CTR register and setting ACK accordingly. The other fields in this register
 *  can also be written at this time to continue on with the transaction. If a
 *  NACK is sent the state machine will automatically send a Stop.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 * @sa          DL_I2CC_setTransactionLength
 */
__STATIC_INLINE void DL_I2CC_enableACKOverride(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR |= UNICOMMI2CC_CTR_ACKOEN_ENABLE;
}

/**
 *  @brief      Disable read on TX empty
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableReadOnTXEmpty(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR &= ~(UNICOMMI2CC_CTR_RD_ON_TXEMPTY_MASK);
}

/**
 *  @brief      Checks if read on TX empty is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If read on TX empty is enabled
 *
 *  @retval     true if read on TX empty is enabled
 *  @retval     false if read on TX empty is disabled
 */
__STATIC_INLINE bool DL_I2CC_isReadOnTXEmptyEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->CTR & UNICOMMI2CC_CTR_RD_ON_TXEMPTY_MASK) ==
            UNICOMMI2CC_CTR_RD_ON_TXEMPTY_ENABLE);
}

/**
 *  @brief      Enable read on TX empty
 *
 *  When enabled, the will transmit all bytes from the TX FIFO
 *  before continuing with the programmed Burst Run Read. If the DIR is not
 *  set to Read in the MSA then this bit is ignored. The Start must be set in
 *  the CTR for proper I2CC protocol. The will first send the Start
 *  Condition, I2CC Address with R/W bit set to write, before sending the bytes
 *  in the TX FIFO. When the TX FIFO is empty, the I2CC transaction will
 *  continue as programmed in MTCR and MSA without sending a Stop Condition.
 *  This is intended to be used to perform simple I2CC command based reads
 *  transition that will complete after initiating them without having to get
 *  an interrupt to turn the bus around.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_I2CC_enableReadOnTXEmpty(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->CTR |= UNICOMMI2CC_CTR_RD_ON_TXEMPTY_ENABLE;
}

/**
 *  @brief      Get the SMBus/PMBus Packet Error Checking (PEC) count value
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The value the PEC count is set to
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2CC_getPECCountValue(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2cc->PECCTL & UNICOMMI2CC_PECCTL_PECCNT_MASK);
}

/**
 *  @brief      Set the SMBus/PMBus Packet Error Checking (PEC) count value
 *
 *  When this field is non zero, the number of I2CC data bytes are counted.
 *  Refer to the device TRM for more details.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  count   The value to set the PEC count to.
 *                      Value between [0x0, 0x01FF]
 */
__STATIC_INLINE void DL_I2CC_setPECCountValue(
    UNICOMM_Inst_Regs *unicomm, uint32_t count)
{
    DL_Common_updateReg(
        &unicomm->i2cc->PECCTL, count, UNICOMMI2CC_PECCTL_PECCNT_MASK);
}

/**
 *  @brief      Disable SMBus/PMBus Packet Error Checking (PEC)
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disablePEC(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->PECCTL &= ~(UNICOMMI2CC_PECCTL_PECEN_MASK);
}

/**
 *  @brief      Checks if SMBus/PMBus Packet Error Checking (PEC)
 *              is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If PEC is enabled
 *
 *  @retval     true if PEC is enabled
 *  @retval     false if PEC is disabled
 */
__STATIC_INLINE bool DL_I2CC_isPECEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->PECCTL & UNICOMMI2CC_PECCTL_PECEN_MASK) ==
            UNICOMMI2CC_PECCTL_PECEN_ENABLE);
}

/**
 *  @brief      Enable SMBus/PMBus Packet Error Checking (PEC)
 *
 *  When enabled, the PEC is calculated on all bits accept the Start, Stop, ACK
 *  and NACK. The PEC LSFR and the Byte Counter is set to 0 when the State
 *  Machine is in the IDLE state, which occurs following a Stop or when a
 *  timeout occurs. The Counter is also set to 0 after the PEC byte is sent or
 *  received. Note that the NACK is automatically sent following a PEC byte
 *  that results in a PEC error.
 *  The PEC Polynomial is x^8 + x^2 + x^1 + 1.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_I2CC_enablePEC(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->PECCTL |= UNICOMMI2CC_PECCTL_PECEN_ENABLE;
}

/**
 *  @brief      Get the current SMBus/PMBus PEC byte count of the
 *              state machine
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The current PEC byte count of the state machine
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2CC_getCurrentPECCount(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2cc->PECSR & UNICOMMI2CC_PECSR_PECSTS_CHECK_MASK);
}

/**
 *  @brief      If SMBus/PMBus PEC was checked in last transaction
 *
 *  The status of if the PEC was checked in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of PEC checked in last transaction
 *
 *  @retval     One of @ref DL_I2CC_PEC_STATUS
 */
__STATIC_INLINE DL_I2CC_PEC_STATUS DL_I2CC_getPECCheckedStatus(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t status =
        unicomm->i2cc->PECSR & UNICOMMI2CC_PECSR_PECSTS_CHECK_MASK;

