TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/demos/field_transmitter/ti/driverlib/dl_unicommi2cc.h
    return (DL_I2CC_SCL)(sclStatus);
}

/**
 *  @brief      Get SDA signal status
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @return     Status of SDA signal
 *
 *  @retval     One of @ref DL_I2CC_SDA
 */
__STATIC_INLINE DL_I2CC_SDA DL_I2CC_getSDAStatus(UNICOMM_Inst_Regs *unicomm)
{
    uint32_t sdaStatus = unicomm->i2cc->BMON & UNICOMMI2CC_BMON_SDA_MASK;

    return (DL_I2CC_SDA)(sdaStatus);
}

/**
 *  @brief      Get TX FIFO threshold level
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @return     Indicates at what fill level in the TX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2CC_TX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2CC_TX_FIFO_LEVEL DL_I2CC_getTXFIFOThreshold(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t level = unicomm->i2cc->IFLS & UNICOMMI2CC_IFLS_TXIFLSEL_MASK;

    return (DL_I2CC_TX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set TX FIFO threshold level
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the TX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2CC_TX_FIFO_LEVEL.
 */
__STATIC_INLINE void DL_I2CC_setTXFIFOThreshold(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_TX_FIFO_LEVEL level)
{
    DL_Common_updateReg(&unicomm->i2cc->IFLS, (uint32_t) level,
        UNICOMMI2CC_IFLS_TXIFLSEL_MASK);
}

/**
 *  @brief      Get RX FIFO threshold level
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @return     Indicates at what fill level in the RX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2CC_RX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2CC_RX_FIFO_LEVEL DL_I2CC_getRXFIFOThreshold(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t level = unicomm->i2cc->IFLS & UNICOMMI2CC_IFLS_RXIFLSEL_MASK;

    return (DL_I2CC_RX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set RX FIFO threshold level
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the RX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2CC_RX_FIFO_LEVEL.
 */
__STATIC_INLINE void DL_I2CC_setRXFIFOThreshold(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_RX_FIFO_LEVEL level)
{
    DL_Common_updateReg(&unicomm->i2cc->IFLS, (uint32_t) level,
        UNICOMMI2CC_IFLS_RXIFLSEL_MASK);
}

/**
 *  @brief      Get number of bytes which can be read from RX FIFO
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @return     Number of bytes which can be read from RX FIFO
 *
 *  @retval     [0x0, 0x8]
 */
__STATIC_INLINE uint32_t DL_I2CC_getRXFIFOCounter(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2cc->SR & UNICOMMI2CC_SR_BCNT_MASK);
}

/**
 *  @brief      Get number of bytes which can be put into TX FIFO
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *
 *  @return     Number of bytes which can be put into TX FIFO
 *
 *  @retval     [0x0, 0x8]
 */
__STATIC_INLINE uint32_t DL_I2CC_getTXFIFOCounter(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2cc->SR & UNICOMMI2CC_SR_BCNT_MASK) >>
            UNICOMMI2CC_SR_BCNT_OFS);
}

/**
 *  @brief      Enable I2CC interrupts
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_I2CC_INTERRUPT.
 */
__STATIC_INLINE void DL_I2CC_enableInterrupt(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    unicomm->i2cc->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable I2CC interrupts
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
 *                             @ref DL_I2CC_INTERRUPT.
 */
__STATIC_INLINE void DL_I2CC_disableInterrupt(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    unicomm->i2cc->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which I2CC interrupts are enabled
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2CC_INTERRUPT.
 *
 *  @return     Which of the requested I2CC interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_I2CC_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2CC_getEnabledInterrupts(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    return (unicomm->i2cc->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled I2CC interrupts
 *
 *  Checks if any of the I2CC interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2CC_INTERRUPT.
 *
 *  @return     Which of the requested I2CC interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2CC_INTERRUPT values
 *
 *  @sa         DL_I2CC_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_I2CC_getEnabledInterruptStatus(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    return (unicomm->i2cc->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any I2CC interrupt
 *
 *  Checks if any of the I2CC interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2CC_INTERRUPT.
 *
 *  @return     Which of the requested I2CC interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2CC_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2CC_getRawInterruptStatus(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    return (unicomm->i2cc->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending I2CC interrupt
 *
 *  Checks if any of the I2CC interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending I2CC interrupt
 *
 *  @retval     One of @ref DL_I2CC_IIDX
 */
__STATIC_INLINE DL_I2CC_IIDX DL_I2CC_getPendingInterrupt(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((DL_I2CC_IIDX) unicomm->i2cc->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending I2CC interrupts
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_I2CC_INTERRUPT.
 */
__STATIC_INLINE void DL_I2CC_clearInterruptStatus(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    unicomm->i2cc->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief Enables I2CC interrupt for triggering DMA events
 *
 * Enables the I2CC interrupt to be used as the condition to generate an
 * event to directly trigger the DMA.
 *
 * Each event publisher @ref DL_I2CC_EVENT_ROUTE can set any one of
 * @ref DL_I2CC_DMA_INTERRUPT.
 *
 * @note Only one interrupt source should be enabled at a time.
 *
 *  @param[in]  unicomm        Pointer to the register overlay for the peripheral
 *  @param[in]  index      Specifies the register event publisher to configure
 *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
 *                         the DMA. One of @ref DL_I2CC_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2CC_enableDMAEvent(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_EVENT_ROUTE index, uint32_t interrupt)
{
    switch (index) {
        case DL_I2CC_EVENT_ROUTE_1:
            unicomm->i2cc->DMA_TRIG1.IMASK = interrupt;
            break;
        case DL_I2CC_EVENT_ROUTE_2:
            unicomm->i2cc->DMA_TRIG0.IMASK = interrupt;
            break;
        default:
            break;
    }
}

/**
 *  @brief Disables I2CC interrupt from triggering DMA events
 *
 * Disables the I2CC interrupt from being used as the condition to generate an
 * event to directly trigger the DMA.
 *
 * Each event publisher @ref DL_I2CC_EVENT_ROUTE can set any one of
 * @ref DL_I2CC_DMA_INTERRUPT.
 *
 *  @param[in]  unicomm        Pointer to the register overlay for the peripheral
 *  @param[in]  index      Specifies the register event publisher to configure
 *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
 *                         the DMA. One of @ref DL_I2CC_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2CC_disableDMAEvent(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_EVENT_ROUTE index, uint32_t interrupt)
{
    switch (index) {
        case DL_I2CC_EVENT_ROUTE_1:
            unicomm->i2cc->DMA_TRIG1.IMASK &= ~(interrupt);
            break;
        case DL_I2CC_EVENT_ROUTE_2:
            unicomm->i2cc->DMA_TRIG0.IMASK &= ~(interrupt);
            break;
        default:
            break;
    }
}

/**
 *  @brief Check which I2CC interrupt for DMA receive events is enabled
 *
 *  This API checks the event publisher register as selected by
 *  @ref DL_I2CC_EVENT_ROUTE, which are used for triggering the DMA for
 *  or Target and receive or transmit events.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the peripheral
 *  @param[in]  index          Specifies the register event publisher to configure
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2CC_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2CC interrupt status
 *
 *  @retval     One of @ref DL_I2CC_DMA_INTERRUPT
 */
__STATIC_INLINE uint32_t DL_I2CC_getEnabledDMAEvents(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_EVENT_ROUTE index,
    uint32_t interruptMask)
{
    volatile uint32_t *pReg = &unicomm->i2cc->DMA_TRIG1.IMASK;

    return ((*(pReg + (uint32_t) index) & interruptMask));
}

/**
 *  @brief Check interrupt flag of enabled I2CC interrupt for DMA event
 *
 *  Checks if any of the I2CC interrupts for the DMA receive event that were
 *  previously enabled are pending.
 *  This API checks the event publisher register as selected by
 *  @ref DL_I2CC_EVENT_ROUTE, which are used for triggering the DMA for
 *  or Target and receive or transmit events.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the peripheral
 *  @param[in]  index          Specifies the register event publisher to configure
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2CC_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2CC interrupt status
 *
 *  @retval     One of @ref DL_I2CC_DMA_INTERRUPT
 *
 *  @sa         DL_I2CC_enableDMAEvent
 */
__STATIC_INLINE uint32_t DL_I2CC_getEnabledDMAEventStatus(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_EVENT_ROUTE index,
    uint32_t interruptMask)
{
    const volatile uint32_t *pReg = &unicomm->i2cc->DMA_TRIG1.MIS;

    return ((*(pReg + (uint32_t) index) & interruptMask));
}

/**
 *  @brief Check interrupt flag of any I2CC interrupt for DMA event
 *
 *  Checks if any of the I2CC interrupts for DMA receive event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the event publisher register as selected by
 *  @ref DL_I2CC_EVENT_ROUTE, which are used for triggering the DMA for
 *  or Target and receive or transmit events.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the peripheral
 *  @param[in]  index          Specifies the register event publisher to configure
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2CC_DMA_INTERRUPT.
 *
 *  @return     Which of the requested I2CC interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2CC_DMA_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2CC_getRawDMAEventStatus(
    UNICOMM_Inst_Regs *unicomm, DL_I2CC_EVENT_ROUTE index,
    uint32_t interruptMask)
{
    const volatile uint32_t *pReg = &unicomm->i2cc->DMA_TRIG1.RIS;

    return ((*(pReg + (uint32_t) index) & interruptMask));
}

/**
 *  @brief      Get the Timeout Counter A value
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The Timeout A counter value
 *
 *  @retval     Value between [0x0, 0xFF]
 */
__STATIC_INLINE uint32_t DL_I2CC_getTimeoutACount(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2cc->TIMEOUT_CTL & UNICOMMI2CC_TIMEOUT_CTL_TCNTLA_MASK);
}

/**
 *  @brief      Set the Timeout Counter A value
 *
 *  Timeout A is used for SCL low detection. This field contains the upper 8
 *  bits of a 12-bit pre-load value for the Timeout A count.
 *  NOTE: The value of the counter must be greater than 1 to enable the
 *  timeout. Each count is equal to 520 times the timeout period of the
 *  functional clock. For example, with 8MHz functional clock and a
 *  100KHz operating I2CC clock, one timeout period will be equal to
 *  (1 / 8MHz) * 520 = 65us.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  count   The value to set the Timeout A counter to.
 *                      Value between [0x0, 0xFF]
 */
__STATIC_INLINE void DL_I2CC_setTimeoutACount(
    UNICOMM_Inst_Regs *unicomm, uint32_t count)
{
    DL_Common_updateReg(&unicomm->i2cc->TIMEOUT_CTL, count,
        UNICOMMI2CC_TIMEOUT_CTL_TCNTLA_MASK);
}

/**
 *  @brief      Disable Timeout Counter A
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableTimeoutA(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->TIMEOUT_CTL &= ~(UNICOMMI2CC_TIMEOUT_CTL_TCNTAEN_MASK);
}

/**
 *  @brief      Checks if Timeout Counter A is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If Timeout Counter A is enabled
 *
 *  @retval     true if Timeout Counter A is enabled
 *  @retval     false if Timeout Counter A is disabled
 */
__STATIC_INLINE bool DL_I2CC_isTimeoutAEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return (
        (unicomm->i2cc->TIMEOUT_CTL & UNICOMMI2CC_TIMEOUT_CTL_TCNTAEN_MASK) ==
        UNICOMMI2CC_TIMEOUT_CTL_TCNTAEN_ENABLE);
}

/**
 *  @brief      Enable Timeout Counter A
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableTimeoutA(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->TIMEOUT_CTL |= UNICOMMI2CC_TIMEOUT_CTL_TCNTAEN_ENABLE;
}

/**
 *  @brief      Get the current Timer Counter A value
 *
 *  This field contains the upper 8 bits of a 12-bit current counter for
 *  Timeout Counter A.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The Timeout A counter value
 *
 *  @retval     Value between [0x0, 0xFF]
 */
__STATIC_INLINE uint32_t DL_I2CC_getCurrentTimeoutACounter(
    UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2cc->TIMEOUT_CNT & UNICOMMI2CC_TIMEOUT_CNT_TCNTA_MASK);
}

/**
 *  @brief      Get the Timeout Counter B value
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The Timeout B counter value
 *
 *  @retval     Value between [0x0, 0xFF]
 */
__STATIC_INLINE uint32_t DL_I2CC_getTimeoutBCount(UNICOMM_Inst_Regs *unicomm)
{
    return (
        (unicomm->i2cc->TIMEOUT_CTL & UNICOMMI2CC_TIMEOUT_CTL_TCNTLB_MASK) >>
        UNICOMMI2CC_TIMEOUT_CTL_TCNTLB_OFS);
}

/**
 *  @brief      Set the Timeout Counter B value
 *
 *  Timeout B is used for SCL high detection. This field contains the upper 8
 *  bits of a 12-bit pre-load value for the Timeout A count.
 *  NOTE: The value of the counter must be greater than 1 to enable the
 *  timeout. Each count is equal to 1* clock period. For example, with 10MHz
 *  functional clock one timeout period will be equal to 1 * 10ns.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  count   The value to set the Timeout A counter to.
 *                      Value between [0x0, 0xFF]
 */
__STATIC_INLINE void DL_I2CC_setTimeoutBCount(
    UNICOMM_Inst_Regs *unicomm, uint32_t count)
{
    DL_Common_updateReg(&unicomm->i2cc->TIMEOUT_CTL,
        (count << UNICOMMI2CC_TIMEOUT_CTL_TCNTLB_OFS),
        UNICOMMI2CC_TIMEOUT_CTL_TCNTLB_MASK);
}

/**
 *  @brief      Disable Timeout Counter B
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_disableTimeoutB(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->TIMEOUT_CTL &= ~(UNICOMMI2CC_TIMEOUT_CTL_TCNTBEN_MASK);
}

/**
 *  @brief      Checks if Timeout Counter B is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If Timeout Counter B is enabled
 *
 *  @retval     true if Timeout Counter B is enabled
 *  @retval     false if Timeout Counter B is disabled
 */
__STATIC_INLINE bool DL_I2CC_isTimeoutBEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return (
        (unicomm->i2cc->TIMEOUT_CTL & UNICOMMI2CC_TIMEOUT_CTL_TCNTBEN_MASK) ==
        UNICOMMI2CC_TIMEOUT_CTL_TCNTBEN_ENABLE);
}

/**
 *  @brief      Enable Timeout Counter B
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CC_enableTimeoutB(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2cc->TIMEOUT_CTL |= UNICOMMI2CC_TIMEOUT_CTL_TCNTBEN_ENABLE;
}

/**
 *  @brief      Get the current Timer Counter B value
 *
 *  This field contains the upper 8 bits of a 12-bit current counter for
 *  Timeout Counter B.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The Timeout B counter value
 *
 *  @retval     Value between [0x0, 0xFF]
 */
__STATIC_INLINE uint32_t DL_I2CC_getCurrentTimeoutBCounter(
    UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2cc->TIMEOUT_CNT & UNICOMMI2CC_TIMEOUT_CNT_TCNTB_MASK);
}

#ifdef __cplusplus
}
#endif

#endif /* __MCU_HAS_UNICOMMI2CC__ */

#endif /* ti_dl_dl_unicomm__include */
/** @}*/
